In [5]:
import pandas as pd
from pathlib import Path

resources = Path("resources")

In [6]:
schools_df = pd.read_csv(resources / "schools_complete.csv")
students_df = pd.read_csv(resources / "students_complete.csv")

In [7]:
complete_df = pd.merge(students_df, schools_df, on=["school_name", "school_name"])
complete_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [8]:
student_count = complete_df["Student ID"].count()
student_count

39170

In [9]:
schools = complete_df["school_name"].unique()
school_count = len(schools)
school_count

15

In [10]:
total_budget = schools_df["budget"].sum()
print(f"${total_budget:,}")

$24,649,428

In [11]:
students_df["reading_score"].mean()

81.87784018381414

In [12]:
students_df["math_score"].mean()

78.98537145774827

In [13]:
passing_math = complete_df[complete_df["math_score"] >= 70]
passing_reading = complete_df[complete_df["reading_score"] >= 70]
passing_math.head(3)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635

In [14]:
passing_reading.head(3)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [15]:
passing_math_count = passing_math["student_name"].count()
passing_reading_count = passing_reading["student_name"].count()
students_total = complete_df["student_name"].count()
passing_math_percentage = 100*passing_math_count / students_total
passing_reading_percentage = 100*passing_reading_count / students_total
print(f"Passing math {passing_math_percentage:.2f}%")
print(f"Passing reading {passing_reading_percentage:.2f}%")
average_math_score = complete_df["math_score"].mean()
average_reading_score = complete_df["reading_score"].mean()

Passing math 74.98%
Passing reading 85.81%

In [16]:
overall_passing = complete_df[(
    complete_df["math_score"] >= 70) &
    (complete_df["reading_score"] >= 70
)]
overall_passing.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635
9,9,Matthew Greene,M,10th,Huang High School,96,84,0,District,2917,1910635

In [17]:
total_num_passed = overall_passing["student_name"].count()
overall_passing_percentage = 100 * total_num_passed / students_total
print(f"Total percent passed: {overall_passing_percentage:.2f}%")

Total percent passed: 65.17%

In [18]:
district_summary_df = pd.DataFrame([
    {"Total Schools": school_count,
    "Total Students": student_count,
    "Total Budget": total_budget,
    "Average Math Score": average_math_score,
    "Average Reading Score": average_reading_score,
    "% Passing Math": passing_math_percentage,
    "% Passing Reading": passing_reading_percentage,
"% Overall Passing": overall_passing_percentage}
])
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,39170,24649428,78.985371,81.87784,74.980853,85.805463,65.172326

In [19]:
f_general = lambda x: f"{x:,}"
f_money = lambda x: f"${x:,.2f}"
f_decimal0 = lambda x: f"{x:.0f}"
f_decimal1 = lambda x: f"{x:.1f}"
district_summary_df["Total Students"] = district_summary_df["Total Students"].map(f_general)
district_summary_df["Total Budget"] = district_summary_df["Total Budget"].map(f_money)
district_summary_df["Average Math Score"] = district_summary_df["Average Math Score"].map(f_decimal1)
district_summary_df["Average Reading Score"] = district_summary_df["Average Reading Score"].map(f_decimal1)
district_summary_df["% Passing Math"] = district_summary_df["% Passing Math"].map(f_decimal0)
district_summary_df["% Passing Reading"] = district_summary_df["% Passing Reading"].map(f_decimal0)
district_summary_df["% Overall Passing"] = district_summary_df["% Overall Passing"].map(f_decimal0)

In [20]:
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,"39,170","$24,649,428.00",79.0,81.9,75,86,65

In [22]:
new_column_order = ["Total Schools", "Total Students", "Total Budget","Average Math Score", "Average Reading Score", "% Passing Math", "% Passing Reading", "% Overall Passing"]
district_summary_df = district_summary_df[new_column_order]
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,"39,170","$24,649,428.00",79.0,81.9,75,86,65

In [27]:
per_school_types = schools_df.set_index(["school_name"])["type"]
per_school_types.head(3)

school_name
Huang High School       District
Figueroa High School    District
Shelton High School      Charter
Name: type, dtype: object

In [30]:
df = pd.DataFrame(per_school_types)
df.head(3)

                          type
school_name
Huang High School     District
Figueroa High School  District
Shelton High School    Charter

In [33]:
per_school_counts = schools_df["size"]
per_school_counts.head(3)

0    2917
1    2949
2    1761
Name: size, dtype: int64

In [37]:
per_school_counts = schools_df.set_index(["school_name"])["size"]
per_school_counts.head(3)

school_name
Huang High School       2917
Figueroa High School    2949
Shelton High School     1761
Name: size, dtype: int64

In [40]:
per_school_counts = schools_df["school_name"].value_counts()
per_school_counts.head(3)

Huang High School       1
Figueroa High School    1
Shelton High School     1
Name: school_name, dtype: int64

In [43]:
per_school_budget = schools_df.set_index(["school_name"])["budget"]
per_school_budget.head(3)

school_name
Huang High School       1910635
Figueroa High School    1884411
Shelton High School     1056600
Name: budget, dtype: int64

In [47]:
per_school_capita = per_school_budget / per_school_counts
per_school_capita.head(3)

school_name
Huang High School       1910635.0
Figueroa High School    1884411.0
Shelton High School     1056600.0
dtype: float64

In [49]:
student_school_math = students_df.set_index(["school_name"])["math_score"]
student_school_math.head(3)

school_name
Huang High School    79
Huang High School    61
Huang High School    60
Name: math_score, dtype: int64

In [52]:
per_school_averages = complete_df.groupby(["school_name"]).mean()
per_school_averages.head(3)

,Student ID,reading_score,math_score,School ID,size,budget
school_name,,,,,,
Bailey High School,20358.5,81.033963,77.048432,7.0,4976.0,3124928.0
Cabrera High School,16941.5,83.975780,83.061895,6.0,1858.0,1081356.0
Figueroa High School,4391.0,81.158020,76.711767,1.0,2949.0,1884411.0

In [54]:
per_school_math = complete_df.groupby(["school_name"]).mean()["math_score"]
per_school_reading = complete_df.groupby(["school_name"]).mean()["reading_score"]
per_school_math.head(3)

school_name
Bailey High School      77.048432
Cabrera High School     83.061895
Figueroa High School    76.711767
Name: math_score, dtype: float64

In [55]:
per_school_reading.head(3)

school_name
Bailey High School      81.033963
Cabrera High School     83.975780
Figueroa High School    81.158020
Name: reading_score, dtype: float64